#1. Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.#

n = int(input())

if n < 1 or n > 7:
    print("Такого дня нет")
elif n > 5:
    print("Выходной")
else:
    print("Рабочий день")  


#2. Напишите программу для проверки ложности утверждения 
#(W ⋀ Z) ⋁ ¬Y ⋁ (¬X ≡ ¬W) для всех значений предикат.#


   