#1. Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.#

n = int(input())

if n < 1 or n > 7:
    print("Такого дня нет")
elif n > 5:
    print("Выходной")
else:
    print("Рабочий день")  